Tekla.Structures.Datatype.DoubleConverter
The DoubleConverter class converts types to and from the double datatype.

Tekla.Structures.Datatype.DoubleConverter.CanConvertFrom(System.ComponentModel.ITypeDescriptorContext,System.Type)
Checks whether the conversion can be made from the source type to the double datatype.
context: The context.
sourceType: The type to convert from.
Returns: True if possible, false if not possible.

Tekla.Structures.Datatype.DoubleConverter.CanConvertTo(System.ComponentModel.ITypeDescriptorContext,System.Type)
Checks whether the conversion can be made from the double datatype to the destination type.
context: The context.
destinationType: The type to convert to.
Returns: True if possible, false if not possible.

Tekla.Structures.Datatype.DoubleConverter.ConvertFrom(System.ComponentModel.ITypeDescriptorContext,System.Globalization.CultureInfo,System.Object)
Converts an object from the given culture to the Tekla.Structures.Datatype.Double type.
context: The context.
culture: The culture.
value: The object to be converted.
Returns: The new double datatype object.

Tekla.Structures.Datatype.DoubleConverter.ConvertTo(System.ComponentModel.ITypeDescriptorContext,System.Globalization.CultureInfo,System.Object,System.Type)
Converts an object from the double datatype to the given destination type.
context: The context.
culture: The target culture.
value: The double datatype object to be converted.
destinationType: The destination type.
Returns: The given double datatype object converted to the new type.